{
  "Objective A": {
    "Principle A1 - Governance": {
      "IGPs": [
        {
          "id": "A1.1",
          "name": "Board Direction",
          "text": "The organisation has an effective organisational security management led at board level and articulated clearly in corresponding policies",
          "status": {
            "Achieved": [
              "Your organisation's approach and policy relating to the security of networks and information systems supporting the operation of essential functions are owned and managed at board level. These are communicated, in a meaningful way, to risk management decision-makers across the organisation.",
              "Regular board discussions on the security of network and information systems supporting the operation of your essential function take place, based on timely and accurate information and informed by expert guidance.",
              "There is a board-level individual who has overall accountability for the security of networks and information systems and drives regular discussion at board-level.",
              "Direction set at board level is translated into effective organisational practices that direct and control the security of the networks and information systems supporting your essential function."
            ],
            "Partially Achieved": [],
            "Not Achieved": [
              "The security of network and information systems related to the operation of essential functions is not discussed or reported on regularly at boardlevel.",
              "Board-level discussions on the security of networks and information systems are based on partial or out-of-date information, without the benefit of expert guidance.",
              "The security of networks and information systems supporting your essential functions are not driven effectively by the direction set at board level.",
              "Senior management or other pockets of the organisation consider themselves exempt from some policies or expect special accommodations to be made."
            ]
          },
          "contextualized_to_park": "In Cyberland Park, this refers to the park leadership ensuring clear policies and oversight for system access and disaster preparedness, such as having backup power systems and multiple administrators with controlled credentials.",
          "related_mitre": [
            {
              "technique_id": "T1078",
              "name": "Valid Accounts",
              "explanation": "Weak account policies at kiosks could allow attackers to abuse valid credentials."
            },
            {
              "technique_id": "T1489",
              "name": "Service Stop",
              "explanation": "Lack of board-level planning for system redundancy allows attackers or natural events to bring down essential services like power or security systems."
            },
            {
              "technique_id": "T0810",
              "name": "Inhibit Response Function",
              "explanation": "Lack of board-level oversight resulted in poor planning of sensor and safety response mechanisms, allowing failures in containment or power systems to go unaddressed."
            }
          ]
        },
        {
          "id": "A1.2",
          "name": "Roles and Responsibilities",
          "text": "The organisation has established roles and responsibilities for the security of networks and information systems at all levels, with clear and well-understood channels for communicating and escalating risks",
          "status": {
            "Achieved": [
              "Necessary roles and responsibilities for the security of networks and information systems supporting your essential function have been identified. These are reviewed periodically to ensure they remain fit for purpose.",
              "Appropriately capable and knowledgeable staff fill those roles and are given the time, authority, and resources to carry out their duties",
              "There is clarity on who in your organisation has overall accountability for the security of the networks and information systems supporting your essential function."
            ],
            "Partially Achieved": [],
            "Not Achieved": [
              "Key roles are missing, left vacant, or fulfilled on an ad-hoc or informal basis.",
              "Staff are assigned security responsibilities but without adequate authority or resources to fulfil them",
              "Staff are unsure what their responsibilities are for the security of the essential function."
            ]
          },
          "contextualized_to_park": "In Cyberland Park, this means clearly assigning staff responsibility for critical systems such as power controls, dinosaur tracking sensors, and access management—ensuring that duties are not centralized in a single person and that everyone knows how to report or escalate issues securely.",
          "related_mitre": [
            {
              "technique_id": "T1078",
              "name": "Valid Accounts",
              "explanation": "Weak account policies at kiosks could allow attackers to abuse valid credentials."
            },
            {
              "technique_id": "T0837",
              "name": "Execution through API",
              "explanation": "Lack of defined responsibilities for system interfaces allowed unauthorized or unmonitored access to control system APIs in the park's infrastructure."
            }
          ]
        },
        {
          "id": "A1.3",
          "name": "Decision Making",
          "text": "The organisation takes appropriate steps to identify, assess and understand security risks to the network and information systems supporting the operation of essential functions. This includes an overall organisational approach to risk management.",
          "status": {
            "Achieved": [
              "Senior management have visibility of key risk decisions made throughout the organisation.",
              "Risk management decision-makers understand their responsibilities for making effective and timely decisions in the context of the risk appetite regarding the essential function, as set by senior management.",
              "Risk management decision-making is delegated and escalated where necessary, across the organisation, to people who have the skills, knowledge, tools, and authority they need.",
              "Risk management decisions are periodically reviewed to ensure their continued relevance and validity."
            ],
            "Partially Achieved": [],
            "Not Achieved": [
              "What should be relatively straightforward risk decisions are constantly referred up the chain, or not made.",
              "Risks are resolved informally (or ignored) at a local level when the use of a more formal risk reporting mechanism would be more appropriate.",
              "Decision-makers are unsure of what senior management's risk appetite is, or only understand it in vague terms such as 'averse' or 'cautious'.",
              "Organisational structure causes risk decisions to be made in isolation. (e.g. engineering and IT don't talk to each other about risk).",
              "Risk priorities are too vague to make meaningful distinctions between them. (e.g. almost all risks are rated 'medium' or 'amber')."
            ]
          },
          "contextualized_to_park": "In Cyberland Park, this refers to how the park evaluates and communicates risks—like ensuring that decisions about power redundancy, dinosaur containment systems, and IT security are made with proper coordination, clear priorities, and support from leadership.",
          "related_mitre": [
            {
              "technique_id": "T0820",
              "name": "Damage to Property",
              "explanation": "Failure to properly assess and escalate infrastructure risks led to avoidable damage during containment breaches and generator failures."
            },
            {
              "technique_id": "T0881",
              "name": "Loss of Safety",
              "explanation": "Disjointed or unclear decision-making around safety systems increased the risk of dinosaur escape or harm to personnel due to unreviewed changes or ignored alerts."
            }
          ]
        }
      ]
    },
    "Principle A2 - Risk Management": {
      "IGPs": [
        {
          "id": "A2.1",
          "name": "Risk Management Process",
          "text": "Your organisation has effective internal processes for managing risks to the security of network and information systems related to the operation of essential functions and communicating associated activities.",
          "status": {
            "Achieved": [
              "Your organisational process ensures that security risks to networks and information systems relevant to essential functions are identified, analysed, prioritised, and managed.",
              "Your approach to risk is focused on the possibility of adverse impact to your essential function, leading to a detailed understanding of how such impact might arise as a consequence of possible attacker actions and the security properties of your networks and information systems.",
              "Your risk assessments are based on a clearly understood set of threat assumptions, informed by an up-to-date understanding of security threats to your essential function and your sector.",
              "Your risk assessments are informed by an understanding of the vulnerabilities in the networks and information systems supporting your essential function.",
              "The output from your risk management process is a clear set of security requirements that will address the risks in line with your organisational approach to security.",
              "Significant conclusions reached in the course of your risk management process are communicated to key security decision-makers and accountable individuals.",
              "Your risk assessments are dynamic and updated in the light of relevant changes which may include technical changes to networks and information systems, change of use and new threat information.",
              "The effectiveness of your risk management process is reviewed periodically, and improvements made as required.",
              "You perform detailed threat analysis and understand how this applies to your organisation in the context of the threat to your sector and the wider CNI."
            ],
            "Partially Achieved": [
              "Your organisational process ensures that security risks to networks and information systems relevant to essential functions are identified, analysed, prioritised, and managed.",
              "Your risk assessments are informed by an understanding of the vulnerabilities in the networks and information systems supporting your essential function.",
              "The output from your risk management process is a clear set of security requirements that will address the risks in line with your organisational approach to security.",
              "Significant conclusions reached in the course of your risk management process are communicated to key security decision-makers and accountable individuals",
              "You conduct risk assessments when significant events potentially affect the essential function, such as replacing a system or a change in the cyber security threat.",
              "You perform threat analysis and understand how generic threats apply to your organisation."
            ],
            "Not Achieved": [
              "Risk assessments are not based on a clearly defined set of threat assumptions.",
              "Risk assessment outputs are too complex or unwieldy to be consumed by decision-makers and are not effectively communicated in a clear and timely manner.",
              "Risk assessments for critical systems are a 'one-off' activity or not done at all.",
              "The security elements of projects or programmes are solely dependent on the completion of a risk management assessment without any regard to the outcomes.",
              "There is no systematic process in place to ensure that identified security risks are managed effectively.",
              "Systems are assessed in isolation, without consideration of dependencies and interactions with other systems. (e.g. interactions between IT and OT environments).",
              "Security requirements and mitigations are arbitrary or are applied from a control catalogue without consideration of how they contribute to the security of the essential function.",
              "Risks remain unresolved on a register for prolonged periods of time awaiting senior decisionmaking or resource allocation to resolve."
            ]
          },
          "contextualized_to_park": "In Cyberland Park, this means having clear processes to regularly assess and manage risks—like power outages, system failures, or containment breaches—so that these threats are understood, prioritized, and mitigated across all park systems including IT, operations, and safety controls.",
          "related_mitre": [
            {
              "technique_id": "T0866",
              "name": "Exploitation of Remote Services",
              "explanation": "Weak or missing risk assessments failed to identify exposed ICS services that were vulnerable to remote exploitation, such as interfaces used for park operations and dinosaur containment."
            },
            {
              "technique_id": "T0820",
              "name": "Damage to Property",
              "explanation": "Insufficient or static risk assessments did not account for evolving threats, allowing attackers or system failures to cause physical damage to park infrastructure."
            }
          ]
        },
        {
          "id": "A2.2",
          "name": "Assurance",
          "text": "You have gained confidence in the effectiveness of the security of your technology, people, and processes relevant to essential functions",
          "status": {
            "Achieved": [
              "You validate that the security measures in place to protect the networks and information systems are effective and remain effective for the lifetime over which they are needed.",
              "You understand the assurance methods available to you and choose appropriate methods to gain confidence in the security of essential functions.",
              "Your confidence in the security as it relates to your technology, people, and processes can be justified to, and verified by, a third party.",
              "Security deficiencies uncovered by assurance activities are assessed, prioritised and remedied when necessary in a timely and effective way.",
              "The methods used for assurance are reviewed to ensure they are working as intended and remain the most appropriate method to use."
            ],
            "Partially Achieved": [],
            "Not Achieved": [
              "A particular product or service is seen as a 'silver bullet' and vendor claims are taken at face value.",
              "Assurance methods are applied without appreciation of their strengths and limitations, such as the risks of penetration testing in operational environments.",
              "Assurance is assumed because there have been no known problems to date."
            ]
          },
          "contextualized_to_park": "In Cyberland Park, this means regularly testing whether safety systems like power backups, dinosaur containment protocols, and access controls actually work as expected, rather than relying on vendor promises or assumptions that 'nothing has gone wrong so far'.",
          "related_mitre": [
            {
              "technique_id": "T0813",
              "name": "Supply Chain Compromise",
              "explanation": "Relying solely on vendor assurances without independent validation introduced hidden vulnerabilities in Jurassic Cyber Park’s ICS systems, such as those managing containment gates or generators."
            },
            {
              "technique_id": "T0806",
              "name": "Loss of Control",
              "explanation": "A lack of assurance testing led to scenarios where attackers or faults could result in the park losing control over critical systems like dinosaur enclosures or electrical infrastructure."
            }
          ]
        }
      ]
    },
    "Principle A3 - Asset Management": {
      "IGPs": [
        {
          "id": "A3.1",
          "name": "Asset Management",
          "text": "Everything required to deliver, maintain or support networks and information systems necessary for the operation of essential functions is determined and understood. This includes data, people and systems, as well as any supporting infrastructure (such as power or cooling).",
          "status": {
            "Achieved": [
              "All assets relevant to the secure operation of essential functions are identified and inventoried (at a suitable level of detail). The inventory is kept up-to-date.",
              "Dependencies on supporting infrastructure (e.g. power, cooling etc) are recognised and recorded.",
              "You have prioritised your assets according to their importance to the operation of the essential function.",
              "You have assigned responsibility for managing physical assets.",
              "Assets relevant to essential functions are managed with cyber security in mind throughout their lifecycle, from creation through to eventual decommissioning or disposal."
            ],
            "Partially Achieved": [],
            "Not Achieved": [
              "Inventories of assets relevant to the essential function are incomplete, non-existent, or inadequately detailed.",
              "Only certain domains or types of asset are documented and understood. Dependencies between assets are not understood (such as the dependencies between IT and OT).",
              "Information assets, which could include personally identifiable information or other sensitive information, are stored for long periods of time with no clear business need or retention policy.",
              "Knowledge critical to the management, operation, or recovery of essential functions is held by one or two key individuals with no succession plan.",
              "Asset inventories are neglected and out of date."
            ]
          },
          "contextualized_to_park": "In Cyberland Park, this means keeping an up-to-date inventory of all critical assets—like dinosaur tracking systems, power generators, IT kiosks, and staff responsibilities—so that everything needed to run and secure the park is known, managed, and not dependent on a single person’s knowledge.",
          "related_mitre": [
            {
              "technique_id": "T0810",
              "name": "Inhibit Response Function",
              "explanation": "Failure to identify and manage dependencies between systems—such as how power outages affect dinosaur containment sensors—allowed adversaries or system failures to disable safety responses without detection."
            },
            {
              "technique_id": "T0829",
              "name": "Manipulation of View",
              "explanation": "Inadequate documentation and control of monitoring interfaces and ICS displays enabled attackers to alter operator views, hiding real-time issues within park infrastructure."
            }
          ]
        }
      ]
    },
    "Principle A4 - Supply Chain": {
      "IGPs": [
        {
          "id": "A4.1",
          "name": "Supply Chain",
          "text": "The organisation understands and manages security risks to networks and information systems supporting the operation of essential functions that arise as a result of dependencies on external suppliers. This includes ensuring that appropriate measures are employed where third party services are used.",
          "status": {
            "Achieved": [
              "You have a deep understanding of your supply chain, including subcontractors and the wider risks it faces. You consider factors such as supplier’s partnerships, competitors, nationality and other organisations with which they subcontract. This informs your risk assessment and procurement processes.",
              "Your approach to supply chain risk management considers the risks to your essential functions arising from supply chain subversion by capable and well-resourced attackers.",
              "You have confidence that information shared with suppliers that is essential to the operation of your function is appropriately protected from sophisticated attacks.",
              "You understand which contracts are relevant and you include appropriate security obligations in relevant contracts. You have a proactive approach to contract management which may include a contract management plan for relevant contracts",
              "Customer / supplier ownership of responsibilities are laid out in contracts.",
              "All network connections and data sharing with third parties are managed effectively and proportionately.",
              "When appropriate, your incident management process and that of your suppliers provide mutual support in the resolution of incidents."
            ],
            "Partially Achieved": [
              "You understand which contracts are relevant and you include appropriate security obligations in relevant contracts.",
              "You understand the general risks suppliers may pose to your essential functions.",
              "You know the extent of your supply chain for essential functions, including subcontractors.",
              "You are aware of all third-party connections and have assurance that they meet your organisation’s security requirements.",
              "Your approach to security incident management considers incidents that might arise in your supply chain.",
              "You have confidence that information shared with suppliers that is necessary for the operation of your essential function is appropriately protected from well-known attacks and known vulnerabilities."
            ],
            "Not Achieved": [
              "You do not know what data belonging to you is held by suppliers, or how it is managed.",
              "Elements of the supply chain for essential functions are subcontracted and you have little or no visibility of the sub-contractors.",
              "You have no understanding of which contracts are relevant and / or relevant contracts do not specify appropriate security obligations.",
              "Suppliers have access to systems that provide your essential function that is unrestricted, not monitored or bypasses your own security controls."
            ]
          },
          "contextualized_to_park": "In Cyberland Park, this means carefully managing risks from third-party suppliers—like those maintaining power systems or dinosaur monitoring software—ensuring they follow strict security rules, have limited and monitored access, and coordinate with the park on incident response.",
          "related_mitre": [
            {
              "technique_id": "T0813",
              "name": "Supply Chain Compromise",
              "explanation": "Suppliers or subcontractors may unintentionally introduce vulnerabilities into Jurassic Cyber Park’s critical OT systems such as power controls or security cameras."
            },
            {
              "technique_id": "T0889",
              "name": "External Remote Services",
              "explanation": "Third-party vendors with remote access to park systems, if not properly controlled or monitored, increase the risk of unauthorized access or sabotage."
            }
          ]
        }
      ]
    }
  },
  
"Objective B": {
    "Principle B1 - Service Protection Policies and Processes": {
        "IGPs": [
        {
            "id": "B1.1",
            "name": "Policy and Process Development",
            "text": "You have developed and continue to improve a set of cyber security and resilience policies and processes that manage and mitigate the risk of adverse impact on the essential function.",
            "status": {
            "Achieved": [
            "Your policies and processes document your overarching security governance and risk management approach, technical security practice and specific regulatory compliance.",
            "You review and update policies and processes in response to major cyber security incidents.",
            "You fully document your overarching security governance and risk management approach, technical security practice and specific regulatory compliance. Cyber security is integrated and embedded throughout these policies and processes and key performance indicators are reported to your executive management.",
            "Your organisation’s policies and processes are developed to be practical, usable and appropriate for your essential function and your technologies.",
            "Policies and processes that rely on user behaviour are practical, appropriate and achievable.",
            "You review and update policies and processes at suitably regular intervals to ensure they remain relevant. Any changes to the essential function or the threat it faces triggers a review of policies and processes."
            ],
            "Partially Achieved": [
            "Policies and processes have not been reviewed in response to major changes (e.g. technology or regulatory framework), or within a suitable period.",
            "Policies and processes are not readily available to staff, too detailed to remember, or too hard to understand.",
            "System security is totally reliant on users' careful and consistent application of manual security processes."
            ],
            "Not Achieved": [
            "Your policies and processes are absent or incomplete.",
            "Policies and processes are not applied universally or consistently.",
            "People often or routinely circumvent policies and processes to achieve business objectives.",
            "Your organisation’s security governance and risk management approach has no bearing on your policies and processes."
            ]
        },
        "contextualized_to_park": "In Cyberland Park, this means having clear, practical policies and processes that everyone—from security staff to researchers—follows to protect park systems and data. These are regularly reviewed and updated after incidents or changes to keep the park safe from evolving cyber risks.",
        "related_mitre": [
            {
              "technique_id": "T1602",
              "name": "Data Manipulation",
              "explanation": "Weak or outdated policies could let attackers manipulate system settings or logs in the park’s security or research systems."
            },
            {
              "technique_id": "T1584",
              "name": "Compromise Infrastructure",
              "explanation": "Poor policy enforcement could allow attackers to exploit infrastructure like power or cooling systems in the park."
            }
            ]
        },
        {
            "id": "B1.2",
            "name": "Policy and Process Implementation",
            "text": "You have successfully implemented your security policies and processes and can demonstrate the security benefits achieved.",
            "status": {
                "Achieved": [
                "All your policies and processes are followed, their correct application and security effectiveness is evaluated.",
                "Your policies and processes are integrated with other organisational policies and processes, including HR assessments of individuals' trustworthiness.",
                "Your policies and processes are effectively and appropriately communicated across all levels of the organisation resulting in good staff awareness of their responsibilities.",
                "Appropriate action is taken to address all breaches of policies and processes with potential to adversely impact the essential function including aggregated breaches.",
                "All breaches of policies and processes with the potential to adversely impact the essential function are fully investigated. Other breaches are tracked, assessed for trends and action is taken to understand and address."
                ],
                "Partially Achieved": [
                "Most of your policies and processes are followed and their application is monitored.",
                "Your policies and processes are integrated with other organisational policies and processes, including HR assessments of individuals' trustworthiness.",
                "Your policies and processes are not well communicated across your organisation.",
                "How your policies support the resilience of your essential functions is not well understood."
                ],
                "Not Achieved": [
                "Policies and processes are ignored or only partially followed.",
                "Staff are unaware of their responsibilities under your policies and processes.",
                "You do not attempt to detect breaches of policies and processes.",
                "Policies and processes lack integration with other organisational policies and processes."
                ]
            },
            "contextualized_to_park": "In Cyberland Park, this means that all staff understand and follow security rules clearly, breaches are detected and investigated promptly, and policies work together across the park to keep systems like electricity, gates, and labs safe.",
            "related_mitre": [
            {
              "technique_id": "T1078",
              "name": "Valid Accounts",
              "explanation": "Weak account policies at kiosks or staff systems could allow attackers to misuse valid credentials."
            },
            {
              "technique_id": "T1566",
              "name": "Phishing",
              "explanation": "Attackers might target staff with phishing to bypass policy controls or gain unauthorized access."
            }
            ]
        }
        ]
    },
    "Principle B2 - Identity and Access Control": {
        "IGPs": [
            {
                "id": "B2.1",
                "name": "Identity Verification, Authentication and Authorisation",
                "text": "You robustly verify, authenticate and authorise access to the networks and information systems supporting your essential function.",
                "status": {
                "Achieved": [
                "Your process of initial identity verification is robust enough to provide a reasonable level of confidence of a user’s identity profile before allowing an authorised user access to networks and information systems that support your essential function.",
                "All authorised users and systems with access to networks or information systems on which your essential function depends are individually identified and authenticated.",
                "The number of authorised users and systems that have access to essential function networks and information systems is limited to the minimum necessary.",
                "You use additional authentication mechanisms, such as multi-factor (MFA), for privileged access to sensitive systems including Operational Technology where appropriate.",
                "You individually authenticate and authorise all remote access to all your networks and information systems that support your essential function.",
                "The list of users and systems with access to essential function networks and systems is reviewed on a regular basis at least annually."
                ],
                "Partially Achieved": [
                "Your process of initial identity verification is robust enough to provide a high level of confidence of a user’s identity profile before allowing an authorised user access to networks and information systems that support your essential function.",
                "Only authorised and individually authenticated users can physically access and logically connect to your networks or information systems on which your essential function depends.",
                "The number of authorised users and systems that have access to all your networks and information systems supporting the essential function is limited to the minimum necessary.",
                "You use additional authentication mechanisms, such as MFA, for privileged access to all systems that operate or support your essential function.",
                "The list of users and systems with access to networks and systems supporting and delivering the essential function is reviewed on a regular basis, at least every six months."
                ],
                "Not Achieved": [
                "Initial identity verification is not robust enough to provide an acceptable level of confidence of a user’s identity profile.",
                "Authorised users and systems with access to networks or information systems on which your essential function depends cannot be individually identified.",
                "Unauthorised individuals or devices can access your networks or information systems on which your essential function depends.",
                "The number of authorised users and systems that have access to your networks and information systems are not limited to the minimum necessary."
                ]
                },
                "contextualized_to_park": "In Cyberland Park, this means strong identity checks and authentication to control access to key systems like dinosaur enclosures, power supplies, and security gates. Only necessary users have access, with multi-factor authentication used for sensitive controls, and regular reviews to keep access tight.",
                "related_mitre": [
                {
                  "technique_id": "T1078",
                  "name": "Valid Accounts",
                  "explanation": "Weak account policies at kiosks or park systems could allow attackers to misuse valid credentials."
                },
                {
                  "technique_id": "T1110",
                  "name": "Brute Force",
                  "explanation": "Attackers might attempt password guessing attacks to gain unauthorized access if authentication is weak."
                }
                ]
            },
            {
              "id": "B2.2",
              "name": "Device Management",
              "text": "You fully know and have trust in the devices that are used to access your networks, information systems and data that support your essential function.",
              "status": {
              "Achieved": [
                "Only corporately owned and managed devices can access your essential function's networks and information systems.",
                "All privileged access occurs from corporately managed devices dedicated to management functions.",
                "You have sought to understand the security properties of third-party devices and networks before they can be connected to your systems and taken steps to mitigate any identified risks.",
                "The act of connecting to a network port or cable does not grant access to any systems.",
                "You are able to detect unknown devices being connected to your network and investigate such incidents.",
                "Dedicated devices are used for privileged actions; these are not used for browsing or email.",
                "You perform certificate-based device identity management and only allow known devices to access systems necessary for the operation of your essential function.",
                "You perform regular scans to detect unknown devices and investigate any findings."
              ],
              "Partially Achieved": [
                "You have sought to understand the security properties of third-party devices and networks before they can be connected to your systems. You have taken appropriate steps to mitigate any risks identified.",
                "Only corporately owned and managed devices can access your essential function's networks and information systems.",
                "You are able to detect unknown devices being connected to your network and investigate such incidents."
              ],
              "Not Achieved": [
                "Users can connect to your essential function's networks using devices that are not corporately managed.",
                "Privileged users can perform administrative functions from devices that are not corporately managed.",
                "You have not gained assurance in the security of any third-party devices or networks connected to your systems.",
                "Physically connecting a device to your network gives that device access without device or user authentication."
              ]
              },
              "contextualized_to_park": "In Cyberland Park, this means only park-owned and managed devices such as kiosks, control panels, and security consoles can access essential networks and systems. Privileged access happens only from dedicated secure devices, and any unknown or third-party device connecting to the network is detected and investigated promptly.",
              "related_mitre": [
               {
                "technique_id": "T1078",
                "name": "Valid Accounts",
                "explanation": "Weak account policies on park devices like kiosks could allow attackers to misuse valid credentials."
              },
              {
                "technique_id": "T1204",
                "name": "User Execution",
                "explanation": "Attackers might trick users into running malicious software on unmanaged devices that connect to the network."
              }
              ]
            },
            {
              "id": "B2.3",
              "name": "Privileged User Management",
              "text": "You closely manage privileged user access to networks and information systems supporting the essential function.",
              "status": {
              "Achieved": [
              "The identities of the individuals with privileged access to your essential function systems (including third parties) are known and managed.",
              "Activity by privileged users is routinely reviewed and validated (e.g., at least annually).",
              "Privileged users are only granted specific privileged permissions essential to their business role.",
              "Privileged user access is carried out from dedicated separate accounts that are closely monitored and managed.",
              "The issuing of temporary, time-bound rights for privileged user access and/or external third-party support access is in place.",
              "Privileged user access rights are regularly reviewed and always updated as part of your joiners, movers and leavers process.",
              "All privileged user access to your networks and information systems requires strong authentication, such as multi-factor (MFA) or additional real-time security monitoring.",
              "All privileged user activity is routinely reviewed, validated and recorded for offline analysis and investigation."
              ],
              "Partially Achieved": [
              "Privileged user access requires additional validation, but this does not use a strong form of authentication (e.g., MFA).",
              "Activity by privileged users is routinely reviewed and validated.",
              "Privileged users are only granted specific privileged permissions essential to their business role."
              ],
              "Not Achieved": [
              "The identities of the individuals with privileged access to your essential function (infrastructure, platforms, software, configuration, etc) are not known or not managed.",
              "Privileged user access to your essential function systems is via weak authentication (e.g. only simple passwords).",
              "The list of privileged users has not been reviewed recently (e.g. within the last 12 months).",
              "Privileged user access is granted on a system-wide basis rather than by role or function.",
              "Privileged user access to your essential function is via generic, shared or default name accounts."
              ]
              },
              "contextualized_to_park": "In Cyberland Park, privileged access to critical systems such as dinosaur enclosures, ticketing kiosks, and security networks is tightly controlled. Only known individuals have such access, with unique accounts requiring multi-factor authentication. Privileged user activities are regularly reviewed and recorded, and temporary elevated rights are time-limited and closely managed.",
              "related_mitre": [
              {
                "technique_id": "T1078",
                "name": "Valid Accounts",
                "explanation": "Weak privileged account policies on park devices like kiosks and control systems could allow attackers to abuse valid credentials."
              },
              {
                "technique_id": "T1110",
                "name": "Brute Force",
                "explanation": "Attackers might attempt to brute force privileged user credentials to gain elevated access to critical systems."
              }
              ]
            },
            {
              "id": "B2.4",
              "name": "Identity and Access Management (IdAM)",
              "text": "You closely manage and maintain identity and access control for users, devices and systems accessing the networks and information systems supporting the essential function.",
              "status": {
              "Achieved": [
              "You follow a robust procedure to verify each user and issue the minimum required access rights, and the application of the procedure is regularly audited.",
              "You regularly review access rights and those no longer needed are revoked.",
              "User permissions are reviewed both when people change roles via your joiners, leavers and movers process and at regular intervals - at least annually.",
              "All user, device and system access to the systems supporting the essential function is logged and monitored.",
              "You regularly review access logs and correlate this data with other access records and expected activity.",
              "Attempts by unauthorised users, devices or systems to connect to the systems supporting the essential function are alerted, promptly assessed and investigated."
              ],
              "Partially Achieved": [
              "You follow a robust procedure to verify each user and issue the minimum required access rights.",
              "You regularly review access rights and those no longer needed are revoked.",
              "User access rights are reviewed when users change roles via your joiners, leavers and movers process."
              ],
              "Not Achieved": [
              "Greater access rights are granted than necessary.",
              "Identity validation and requirement for access of a user, device or systems is not carried out.",
              "User access rights are not reviewed when users change roles.",
              "User access rights remain active when users leave your organisation."
              ]
              },
              "contextualized_to_park": "In Cyberland Park, clear staff rules govern identity and access management for all systems supporting critical park functions like dinosaur enclosure controls and ticketing kiosks. Access is limited to the minimum required permissions, regularly reviewed, logged, and monitored. Unauthorized access attempts are promptly investigated.",
              "related_mitre": [
              {
                "technique_id": "T1078",
                "name": "Valid Accounts",
                "explanation": "Weak account policies on park kiosks or control systems could allow attackers to abuse valid credentials."
              },
              {
                "technique_id": "T1110",
                "name": "Brute Force",
                "explanation": "Attackers may attempt to brute force credentials to gain unauthorized access."
              }
          ]
        }
      ]
    },
    "Principle B3 - Data Security": {
        "IGPs": [
        {
            "id": "B3.1",
            "name": "Understanding Data",
            "text": "You have a good understanding of data important to the operation of the essential function, where it is stored, where it travels and how unavailability or unauthorised access, modification or deletion would adversely impact the essential function.",
            "status": {
            "Achieved": [
            "You have identified and catalogued all the data important to the operation of the essential function, or that would assist an attacker.",
            "You have identified and catalogued who has access to the data important to the operation of the essential function.",
            "You periodically review location, transmission, quantity and quality of data important to the operation of the essential function.",
            "You have identified all mobile devices and media that hold data important to the operation of the essential function.",
            "You understand and document the impact on your essential function of all relevant scenarios, including unauthorised access, modification or deletion, or when authorised users are unable to appropriately access this data.",
            "You validate these documented impact statements regularly, at least annually.",
            "You take steps to remove or minimise unnecessary copies or unneeded historic data."
            ],
            "Partially Achieved": [
            "You have identified and catalogued all the data important to the operation of the essential function, or that would assist an attacker.",
            "You have identified and catalogued who has access to the data important to the operation of the essential function.",
            "You occasionally validate these documented impact statements."
            ],
            "Not Achieved": [
            "You have incomplete knowledge of what data is used by and produced in the operation of the essential function.",
            "You have not identified the important data on which your essential function relies.",
            "You have not identified who has access to data important to the operation of the essential function.",
            "You have not clearly articulated the impact of data compromise or lack of availability."
            ]
            },
            "contextualized_to_park": "In Cyberland Park, this means having clear rules and records about the storage, access, and movement of critical data such as ticket sales, dinosaur monitoring, and staff logs. The park regularly reviews how data compromise or loss would impact operations and takes steps to remove unnecessary data copies.",
            "related_mitre": [
            {
              "technique_id": "T1078",
              "name": "Valid Accounts",
              "explanation": "Weak account policies at kiosks could allow attackers to abuse valid credentials."
            },
            {
              "technique_id": "T1020",
              "name": "Automated Data Collection",
              "explanation": "Attackers may gather data automatically from compromised systems."
            }
            ]
            },
            {
            "id": "B3.2",
            "name": "Data in Transit",
            "text": "You have protected the transit of data important to the operation of the essential function. This includes the transfer of data to third parties.",
            "status": {
            "Achieved": [
            "You have identified and protected (effectively and proportionately) all the data links that carry data important to the operation of your essential function.",
            "You apply appropriate physical and/or technical means to protect data that travels over non-trusted or openly accessible carriers, with justified confidence in the robustness of the protection applied.",
            "Suitable alternative transmission paths are available where there is a significant risk of impact on the operation of the essential function due to resource limitation (e.g. transmission equipment or function failure, or important data being blocked or jammed)."
            ],
            "Partially Achieved": [
            "You have identified and protected (effectively and proportionately) all the data links that carry data important to the operation of your essential function.",
            "You apply appropriate technical means (e.g., cryptography) to protect data that travels over non-trusted or openly accessible carriers, but you have limited or no confidence in the robustness of the protection applied."
            ],
            "Not Achieved": [
            "You do not know what all your data links are, or which carry data important to the operation of the essential function.",
            "Data important to the operation of the essential function travels without technical protection over non-trusted or openly accessible carriers.",
            "Critical data paths that could fail, be jammed, be overloaded, etc. have no alternative path."
            ]
            },
            "contextualized_to_park": "In Cyberland Park, this means ensuring all data transmissions—such as ticket purchases, booking details, and dinosaur monitoring information—are protected with encryption and other safeguards. Alternative communication routes are available to keep data flowing even if the main network path is disrupted.",
            "related_mitre": [
            {
              "technique_id": "T1078",
              "name": "Valid Accounts",
              "explanation": "Weak account policies at kiosks could allow attackers to abuse valid credentials."
            },
            {
              "technique_id": "T1557",
              "name": "Man-in-the-Middle",
              "explanation": "Attackers may intercept data traveling over networks to steal or alter it."
            }
            ]
            },
            {
            "id": "B3.3",
            "name": "Stored Data",
            "text": "You have protected stored soft and hard copy data important to the operation of the essential function.",
            "status": {
            "Achieved": [
            "All copies of data important to the operation of your essential function are necessary. Where this important data is transferred to less secure systems, the data is provided with limited detail and/or as a read-only copy.",
            "You have applied suitable physical and/or technical means to protect this important stored data from unauthorised access, modification or deletion.",
            "If cryptographic protections are used you apply suitable technical and procedural means, and you have justified confidence in the robustness of the protection applied.",
            "You have suitable, secured backups of data to allow the operation of the essential function to continue should the original data not be available. This may include off-line or segregated backups, or appropriate alternative forms such as paper copies.",
            "Necessary historic or archive data is suitably secured in storage."
            ],
            "Partially Achieved": [
            "All copies of data important to the operation of your essential function are necessary. Where this important data is transferred to less secure systems, the data is provided with limited detail and/or as a read-only copy.",
            "If cryptographic protections are used, you apply suitable technical and procedural means, but you have limited or no confidence in the robustness of the protection applied.",
            "You have applied suitable physical and/or technical means to protect this important stored data from unauthorised access, modification or deletion.",
            "You have suitable, secured backups of data to allow the operation of the essential function to continue should the original data not be available."
            ],
            "Not Achieved": [
            "You have no, or limited, knowledge of where data important to the operation of the essential function is stored.",
            "You have not protected vulnerable stored data important to the operation of the essential function in a suitable way.",
            "Backups are incomplete, untested, not adequately secured or could be inaccessible in a disaster recovery or business continuity situation."
            ]
            },
            "contextualized_to_park": "In Cyberland Park, this means securely storing essential data like ticket records, visitor details, and dinosaur health logs—whether digital or physical. Encryption, access controls, and backups (including offline copies) ensure that important information remains protected and available when needed.",
            "related_mitre": [
            {
              "technique_id": "T1078",
              "name": "Valid Accounts",
              "explanation": "Weak account policies at kiosks could allow attackers to abuse valid credentials."
            },
            {
              "technique_id": "T1565.001",
              "name": "Data Manipulation: Stored Data",
              "explanation": "Attackers may manipulate stored information—such as visitor logs or dinosaur health data—to disrupt operations or conceal their activities."
            },
            {
              "technique_id": "T1490",
              "name": "Inhibit System Recovery",
              "explanation": "Attackers may encrypt or delete backups, preventing Jurassic Cyber Park from recovering important stored data after an incident."
            }

            ]
            },
            {
            "id": "B3.4",
            "name": "Mobile Data",
            "text": "You have protected data important to the operation of the essential function on mobile devices.",
            "status": {
            "Achieved": [
            "Mobile devices that hold data that is important to the operation of the essential function are catalogued, are under your organisation's control and configured according to best practice for the platform, with appropriate technical and procedural policies in place.",
            "Your organisation can remotely wipe all mobile devices holding data important to the operation of essential function.",
            "You have minimised this data on these mobile devices. Some data may be automatically deleted off mobile devices after a certain period.",
            "Data important to the operation of the essential function is only stored on mobile devices with at least equivalent security standard to your organisation.",
            "Data on mobile devices is technically secured."
            ],
            "Partially Achieved": [
            "You know which mobile devices hold data important to the operation of the essential function.",
            "Data important to the operation of the essential function is only stored on mobile devices with at least equivalent security standard to your organisation.",
            "Data on mobile devices is technically secured."
            ],
            "Not Achieved": [
            "You don’t know which mobile devices may hold data important to the operation of the essential function.",
            "You allow data important to the operation of the essential function to be stored on devices not managed by your organisation, or to at least equivalent standard.",
            "Data on mobile devices is not technically secured, or only some is secured."
            ]
            },
            "contextualized_to_park": "In Cyberland Park, this means ensuring that only managed mobile devices like staff tablets or apps used for ticketing hold essential data, with encryption, remote wipe capabilities, and minimal data storage.",
            "related_mitre": [
            {
              "technique_id": "T1078",
              "name": "Valid Accounts",
              "explanation": "If a mobile device with valid credentials is compromised, attackers could use it to access park systems."
            },
            {
              "technique_id": "T1530",
              "name": "Data from Cloud Storage Object",
              "explanation": "Attackers could compromise mobile syncs to access data stored in cloud accounts connected to park systems."
            }
            ]
            },
            {
            "id": "B3.5",
            "name": "Media / Equipment Sanitisation",
            "text": "Before reuse and / or disposal you appropriately sanitise devices, equipment and removable media holding data important to the operation of the essential function.",
            "status": {
            "Achieved": [
            "Data important to the operations of the essential function is removed from all devices, equipment and removable media before reuse and / or disposal.",
            "You catalogue and track all devices that contain data important to the operation of the essential function (whether a specific storage device or one with integral storage).",
            "Data important to the operation of your essential function is removed from all devices, equipment and removable media before reuse and / or disposal using an assured product or service."
            ],
            "Partially Achieved": [
            "Data important to the operations of the essential function is removed from all devices, equipment and removable media before reuse and / or disposal.",
            "You catalogue and track all devices that contain data important to the operation of the essential function."
            ],
            "Not Achieved": [
            "Some or all devices, equipment or removable media that hold data important to the operation of the essential function are reused or disposed of without sanitisation of that data."
            ]
            },
            "contextualized_to_park": "In Cyberland Park, this means ensuring that any kiosk systems, ticketing tablets, or removable drives used in operations are securely wiped or destroyed before being reused or discarded, to prevent leakage of sensitive ticketing or personal data.",
            "related_mitre": [
            {
              "technique_id": "T1078",
              "name": "Valid Accounts",
              "explanation": "Improper sanitisation may leave behind credentials or session data that attackers could exploit to access systems."
            },
            {
              "technique_id": "T1561",
              "name": "Disk Wipe",
              "explanation": "Adversaries may attempt to hide their activity or destroy evidence by wiping media; similarly, defenders must proactively wipe devices to prevent data leaks."
            },
            {
              "technique_id": "T1200",
              "name": "Hardware Additions",
              "explanation": "If sanitisation is incomplete, adversaries may retrieve data from disposed or repurposed hardware via physical access."
            }
          ]
        }
      ]
    },
    "Principle B4 - System Security": {
    "IGPs": [
      {
        "id": "B4.1",
        "name": "Secure by Design",
        "text": "You design security into the network and information systems that support the operation of essential functions. You minimise their attack surface and ensure that the operation of the essential function should not be impacted by the exploitation of any single vulnerability.",
        "status": {
        "Achieved": [
        "Your networks and information systems are segregated into appropriate security zones, e.g. operational systems for the essential function are segregated in a highly trusted, more secure zone.",
        "The networks and information systems supporting your essential function are designed to have simple data flows between components to support effective security monitoring.",
        "The networks and information systems supporting your essential function are designed to be easy to recover.",
        "Content-based attacks are mitigated for all inputs to operational systems that affect the essential function (e.g. via transformation and inspection).",
        "You employ appropriate expertise to design network and information systems and design strong boundary defences where your networks and information systems interface with other organisations or the world at large."
        ],
        "Partially Achieved": [
        "You employ appropriate expertise to design network and information systems.",
        "You design strong boundary defences where your networks and information systems interface with other organisations or the world at large.",
        "You design simple data flows between your networks and information systems and any external interface to enable effective monitoring.",
        "You design to make network and information system recovery simple."
        ],
        "Not Achieved": [
        "Systems essential to the operation of the essential function are not appropriately segregated from other systems.",
        "Internet access is available from operational systems.",
        "Data flows between the essential function's operational systems and other systems are complex, making it hard to discriminate between legitimate and illegitimate/malicious traffic.",
        "Remote or third party accesses circumvent some network controls to gain more direct access to operational systems of the essential function."
        ]
        },
        "contextualized_to_park": "In Cyberland Park, this means designing ticketing systems and kiosks with strong network segmentation, simplified data flows, and robust boundary protections to reduce risks from attacks and system failures.",
        "related_mitre": [
        {
          "technique_id": "T1598",
          "name": "Data from Information Repositories",
          "explanation": "Attackers may target poorly segmented or unprotected repositories to extract sensitive data."
        },
        {
          "technique_id": "T1078",
          "name": "Valid Accounts",
          "explanation": "Weak account policies at kiosks could allow attackers to abuse valid credentials."
        }
        ]
      },
      {
      "id": "B4.2",
      "name": "Secure Configuration",
      "text": "You securely configure the network and information systems that support the operation of essential functions.",
      "status": {
      "Achieved": [
      "You have identified, documented and actively manage (e.g. maintain security configurations, patching, updating according to good practice) the assets that need to be carefully configured to maintain the security of the essential function.",
      "All platforms conform to your secure, defined baseline build, or the latest known good configuration version for that environment.",
      "You closely and effectively manage changes in your environment, ensuring that network and system configurations are secure and documented.",
      "You regularly review and validate that your network and information systems have the expected, secure settings and configuration.",
      "Only permitted software can be installed and standard users cannot change settings that would impact security or the business operation.",
      "You verify software before installation is permitted."
      ],
      "Partially Achieved": [
      "You have identified and documented the assets that need to be carefully configured to maintain the security of the essential function.",
      "Secure platform and device builds are used across the estate.",
      "Consistent, secure and minimal system and device configurations are applied across the same types of environment.",
      "Changes and adjustments to security configuration at security boundaries with the networks and information systems supporting your essential function are approved and documented."
      ],
      "Not Achieved": [
      "You haven't identified the assets that need to be carefully configured to maintain the security of the essential function.",
      "Policies relating to the security of operating system builds or configuration are not applied consistently across your network and information systems relating to your essential function.",
      "Configuration details are not recorded or lack enough information to be able to rebuild the system or device.",
      "The recording of security changes or adjustments that affect your essential function is lacking or inconsistent."
      ]
      },
      "contextualized_to_park": "In Cyberland Park, this means documented and enforced secure configurations across all critical systems. The research center must have robust network security and hardened Active Directory configurations to prevent unauthorized access or privilege escalation. The park must avoid a single point of failure by managing administrator credentials carefully, ensuring no one person has uncontrolled access. Furthermore, ICS and IoT devices like electrical generators and dinosaur movement sensors must be securely configured and segmented from other networks to prevent manipulation or disruption.",
      "related_mitre": [
      {
        "technique_id": "T1078",
        "name": "Valid Accounts",
        "explanation": "The single system administrator with sole knowledge of passwords creates a risk where attackers could exploit valid accounts to gain unauthorized access."
      },
      {
        "technique_id": "T1489",
        "name": "Service Stop",
        "explanation": "Attackers could stop critical services such as electrical generators to cause outages and disrupt park operations."
      },
      {
        "technique_id": "T0889",
        "name": "Exploitation for Privilege Escalation",
        "explanation": "Weak Active Directory and network configurations in the research center could allow attackers to escalate privileges."
      },
      {
        "technique_id": "T0877",
        "name": "Unauthorized Command Message",
        "explanation": "Manipulating commands to IoT devices like movement sensors could allow attackers to mislead the park's monitoring systems."
      }
      ]
      },
      {
      "id": "B4.3",
      "name": "Secure Management",
      "text": "You manage your organisation's network and information systems that support the operation of essential functions to enable and maintain security.",
      "status": {
      "Achieved": [
      "Your systems and devices supporting the operation of the essential function are only administered or maintained by authorised privileged users from dedicated devices that are technically segregated and secured to the same level as the networks and systems being maintained.",
      "Technical knowledge about networks and information systems, such as documentation and network diagrams, is regularly reviewed and updated and securely stored.",
      "You prevent, detect and remove malware or unauthorised software using technical, procedural and physical measures as necessary."
      ],
      "Partially Achieved": [
      "Your systems and devices supporting the operation of the essential function are only administered or maintained by authorised privileged users from dedicated devices.",
      "Technical knowledge about networks and information systems, such as documentation and network diagrams, is regularly reviewed and updated.",
      "You prevent, detect and remove malware or unauthorised software using appropriate measures."
      ],
      "Not Achieved": [
      "Essential function networks and systems are administered or maintained using non-dedicated devices.",
      "You do not have good or current technical documentation of your networks and information systems."
      ]
      },
      "contextualized_to_park": "In Cyberland Park, this means ensuring privileged system administration is done only by authorized personnel from dedicated, secure devices segregated from general networks. Network diagrams and technical documentation of the park’s systems, including the research centre and ICS devices, must be regularly updated and securely stored. Strict malware prevention and removal practices are vital to avoid compromising critical systems like electrical generators and movement sensors.",
      "related_mitre": [
       {
        "technique_id": "T1078",
        "name": "Valid Accounts",
        "explanation": "Weak management of privileged accounts, such as the single system administrator, risks abuse of valid credentials."
      },
      {
        "technique_id": "T1562",
        "name": "Impair Defenses",
        "explanation": "Attackers could deploy malware or unauthorized software to disable security tools protecting the park’s essential systems."
      },
      {
        "technique_id": "T1190",
        "name": "Exploit Public-Facing Application",
        "explanation": "Exposed management interfaces of ICS or research center systems could be exploited to gain unauthorized access."
      }
      ]
      },
      {
      "id": "B4.4",
      "name": "Vulnerability Management",
      "text": "You manage known vulnerabilities in your network and information systems to prevent adverse impact on the essential function.",
      "status": {
      "Achieved": [
      "You maintain a current understanding of the exposure of your essential function to publicly-known vulnerabilities.",
      "Announced vulnerabilities for all software packages, network equipment and operating systems used to support your essential function are tracked, prioritised and mitigated (e.g. by patching) promptly.",
      "You regularly test to fully understand the vulnerabilities of the networks and information systems that support the operation of your essential function and verify this understanding with third-party testing.",
      "You maximise the use of supported software, firmware and hardware in your networks and information systems supporting your essential function."
      ],
      "Partially Achieved": [
      "You maintain a current understanding of the exposure of your essential function to publicly-known vulnerabilities.",
      "Announced vulnerabilities for all software packages, network equipment and operating systems used to support your essential function are tracked, prioritised and externally-exposed vulnerabilities are mitigated (e.g. by patching) promptly.",
      "Some vulnerabilities that are not externally exposed have temporary mitigations for an extended period.",
      "You have temporary mitigations for unsupported systems and software while pursuing migration to supported technology.",
      "You regularly test to fully understand the vulnerabilities of the networks and information systems that support the operation of your essential function."
      ],
      "Not Achieved": [
      "You do not understand the exposure of your essential function to publicly-known vulnerabilities.",
      "You do not mitigate externally-exposed vulnerabilities promptly.",
      "You have not recently tested to verify your understanding of the vulnerabilities of the networks and information systems that support your essential function.",
      "You have not suitably mitigated systems or software that is no longer supported.",
      "You are not pursuing replacement for unsupported systems or software."
      ]
      },
      "contextualized_to_park": "In Cyberland Park, this means continuously tracking and promptly patching vulnerabilities in all park systems—from research center servers to ICS devices managing electrical generators and movement sensors. Legacy or unsupported systems must be phased out or mitigated. Regular vulnerability testing, including third-party audits, ensures the park’s infrastructure is resilient against known exploits that could threaten dinosaur containment or park safety.",
      "related_mitre": [
      {
        "technique_id": "T1190",
        "name": "Exploit Public-Facing Application",
        "explanation": "Attackers could exploit vulnerabilities in exposed applications at the research center or ICS interfaces."
      },
      {
        "technique_id": "T1203",
        "name": "Exploitation for Client Execution",
        "explanation": "Exploiting software or firmware vulnerabilities to execute malicious code, particularly in outdated ICS or research center systems."
      },
      {
        "technique_id": "T1078",
        "name": "Valid Accounts",
        "explanation": "Vulnerabilities could be leveraged to steal or abuse valid credentials."
      },
      {
        "technique_id": "T1499",
        "name": "Endpoint Denial of Service",
        "explanation": "Attackers might exploit vulnerabilities to disrupt critical ICS devices, causing denial of service to electrical generators or movement sensors."
      }
      ]
      }
      ]
    },
    "Principle B5 - Resilient Networks and Systems": {
    "IGPs": [
    {
    "id": "B5.1",
    "name": "Resilience Preparation",
    "text": "You are prepared to restore the operation of your essential function following adverse impact.",
    "status": {
    "Achieved": [
    "You know all networks, information systems and underlying technologies that are necessary to restore the operation of the essential function and understand their interdependence.",
    "You know the order in which systems need to be recovered to efficiently and effectively restore the operation of the essential function.",
    "You have business continuity and disaster recovery plans that have been tested for practicality, effectiveness and completeness. Appropriate use is made of different test methods, e.g. manual fail-over, table-top exercises, or red-teaming.",
    "You use your security awareness and threat intelligence sources, to make immediate and potentially temporary security changes in response to new threats, e.g. a widespread outbreak of very damaging malware."
    ],
    "Partially Achieved": [
    "You know all networks, information systems and underlying technologies that are necessary to restore the operation of the essential function and understand their interdependence.",
    "You have business continuity and/or disaster recovery plans for your essential function’s networks, information systems and their dependencies.",
    "You have not fully assessed the practical implementation of your disaster recovery plans."
    ],
    "Not Achieved": [
    "You have limited understanding of all the elements that are required to restore operation of the essential function.",
    "You have not completed business continuity and/or disaster recovery plans for your essential function’s networks, information systems and their dependencies.",
    "You have not fully assessed the practical implementation of your disaster recovery plans."
    ]
    },
    "contextualized_to_park": "In Cyberland Park, resilience preparation means knowing all key systems—research center networks, ICS controlling electrical generators and dinosaur sensors—and how they depend on each other. Recovery plans specify the order systems must be restored, prioritizing life safety and containment. These plans are regularly tested using realistic exercises such as failovers and red-teaming. The park also monitors threat intelligence to quickly adapt to new cyber threats, minimizing downtime and risk to both people and dinosaurs.",
    "related_mitre": [
     {
      "technique_id": "T1486",
      "name": "Data Encrypted for Impact",
      "explanation": "Ransomware attacks could encrypt critical systems, making rapid recovery essential."
    },
    {
      "technique_id": "T1499",
      "name": "Endpoint Denial of Service",
      "explanation": "Denial of service attacks on ICS devices could disrupt essential park functions."
    },
    {
      "technique_id": "T1078",
      "name": "Valid Accounts",
      "explanation": "Compromise of valid accounts could lead to breaches necessitating incident response and recovery."
    },
    {
      "technique_id": "T1566",
      "name": "Phishing",
      "explanation": "Phishing attacks could impact key personnel, delaying recovery efforts."
    }
    ]
    },
    {
    "id": "B5.2",
    "name": "Design for Resilience",
    "text": "You design the network and information systems supporting your essential function to be resilient to cyber security incidents. Systems are appropriately segregated and resource limitations are mitigated.",
    "status": {
    "Achieved": [
    "Operational systems that support the operation of the essential function are segregated from other business and external systems by appropriate technical and physical means, e.g. separate network and system infrastructure with independent user administration.",
    "Internet services are not accessible from operational systems.",
    "You have identified and mitigated all resource limitations, e.g. bandwidth limitations and single network paths.",
    "You have identified and mitigated any geographical constraints or weaknesses (e.g. systems that your essential function depends upon are replicated in another location, important network connectivity has alternative physical paths and service providers).",
    "You review and update assessments of dependencies, resource and geographical limitations and mitigations when necessary."
    ],
    "Partially Achieved": [
    "Operational systems that support the operation of the essential function are logically separated from your business systems, e.g., they reside on the same network as the rest of the organisation, but within a DMZ. Internet access is not available from operational systems.",
    "Resource limitations (e.g., network bandwidth, single network paths) have been identified but not fully mitigated."
    ],
    "Not Achieved": [
    "Operational networks and systems are not appropriately segregated.",
    "Internet services, such as browsing and email, are accessible from essential operational systems supporting the essential function.",
    "You do not understand or lack plans to mitigate all resource limitations that could adversely affect your essential function."
    ]
    },
    "contextualized_to_park": "In Cyberland Park, this means strictly segregating the ICS networks controlling electrical generators, dinosaur movement sensors, and containment systems from business and research networks. Operational systems must have no direct internet access to prevent external attacks. Redundancies in network paths and power supply ensure critical systems remain operational during failures or attacks. Geographic replication of backups and alternate connectivity paths mitigate natural disaster risks. Regular assessments ensure resilience measures adapt to evolving risks.",
    "related_mitre": [
    {
      "technique_id": "T1078",
      "name": "Valid Accounts",
      "explanation": "Segregation and strong access controls limit the abuse of valid credentials to move laterally across systems."
    },
    {
      "technique_id": "T1499",
      "name": "Endpoint Denial of Service",
      "explanation": "Network design mitigations reduce the impact of DoS attacks on critical operational systems."
    },
    {
      "technique_id": "T1489",
      "name": "Service Stop",
      "explanation": "Resilient design helps maintain essential services even under attack aiming to disrupt operations."
    }
    ]
    },
    {
    "id": "B5.3",
    "name": "Backups",
    "text": "You hold accessible and secured current backups of data and information needed to recover operation of your essential function.",
    "status": {
    "Achieved": [
    "You have appropriately secured backups (including data, configuration information, software, equipment, processes and knowledge). These backups will be accessible to recover from an extreme event.",
    "You routinely test backups to ensure that the backup process functions correctly and the backups are usable.",
    "Your comprehensive, automatic and tested technical and procedural backups are secured at centrally accessible or secondary sites to recover from an extreme event.",
    "Backups of all important data and information needed to recover the essential function are made, tested, documented and routinely reviewed."
    ],
    "Partially Achieved": [
    "You have appropriately secured backups (including data, configuration information, software, equipment, processes and knowledge). These backups will be accessible to recover from an extreme event.",
    "You routinely test backups to ensure that the backup process functions correctly and the backups are usable."
    ],
    "Not Achieved": [
    "Backup coverage is incomplete and does not include all relevant data and information needed to restore the operation of your essential function.",
    "Backups are not frequent enough for the operation of your essential function to be restored within a suitable time-frame."
    ]
    },
    "contextualized_to_park": "In Cyberland Park, this means maintaining secure, regularly tested backups of all critical data and configurations—including research data, Active Directory credentials, ICS device settings for generators and dinosaur sensors, and operational procedures. Backups are stored offsite or in secure secondary locations to enable recovery after extreme events such as natural disasters or ransomware attacks. Regular tests ensure backups are usable and restoration processes are reliable, preventing operational paralysis even if the single system administrator is unavailable.",
    "related_mitre": [
    {
      "technique_id": "T1078",
      "name": "Valid Accounts",
      "explanation": "Protecting backup credentials helps prevent attackers from abusing valid accounts to disrupt recovery."
    },
    {
      "technique_id": "T1486",
      "name": "Data Encrypted for Impact",
      "explanation": "Backups provide recovery options if ransomware encrypts operational data."
    },
    {
      "technique_id": "T1005",
      "name": "Data from Local System",
      "explanation": "Attackers may target local backup files, so securing backup storage is essential."
    }
    ]
    }
    ]
    },
    "Principle B6 - Staff Awareness and Training": {
    "IGPs": [
    {
    "id": "B6.1",
    "name": "Cyber Security Culture",
    "text": "You develop and maintain a positive cyber security culture.",
    "status": {
    "Achieved": [
    "Your executive management understand and widely communicate the importance of a positive cyber security culture. Positive attitudes, behaviours and expectations are described for your organisation.",
    "All people in your organisation understand the contribution they make to the essential functions cyber security.",
    "All individuals in your organisation know who to contact and where to access more information about cyber security. They know how to raise a cyber security issue.",
    "People in your organisation raising potential cyber security incidents and issues are treated positively.",
    "Individuals at all levels in your organisation routinely report concerns or issues about cyber security and are recognised for their contribution to keeping the organisation secure.",
    "Your management is seen to be committed to and actively involved in cyber security.",
    "Your organisation communicates openly about cyber security, with any concern being taken seriously.",
    "People across your organisation participate in cyber security activities and improvements, building joint ownership and bringing knowledge of their area of expertise."
    ],
    "Partially Achieved": [
    "Your executive management understand and widely communicate the importance of a positive cyber security culture.",
    "All people in your organisation understand the contribution they make to the essential functions cyber security.",
    "All individuals in your organisation know who to contact and where to access more information about cyber security. They know how to raise a cyber security issue.",
    "Your organisation's approach to cyber security is perceived by staff as hindering the business of the organisation."
    ],
    "Not Achieved": [
    "People in your organisation don't understand what they contribute to the cyber security of the essential function.",
    "People in your organisation don't know how to raise a concern about cyber security.",
    "People believe that reporting issues may get them into trouble."
    ]
    },
    "contextualized_to_park": "In Cyberland Park, all staff—ranging from the system administrator, researchers, maintenance teams, to security personnel—are trained and encouraged to understand their role in cyber security. Management actively promotes open communication, where reporting cyber incidents or suspicious activity is welcomed and rewarded without fear. This helps prevent incidents caused by social engineering, insider threats, or neglect. Training includes recognizing phishing, securing valid accounts, and reporting unusual system behavior.",
    "related_mitre": [
    {
      "technique_id": "T1078",
      "name": "Valid Accounts",
      "explanation": "Strong cyber security culture supports good account management and reduces risks of credential abuse."
    },
    {
      "technique_id": "T1566",
      "name": "Phishing",
      "explanation": "Educated staff are more likely to detect and report phishing attempts."
    },
    {
      "technique_id": "T1489",
      "name": "Service Stop",
      "explanation": "Timely reporting can help mitigate denial of service or disruption attacks."
    }
    ]
    },
    {
    "id": "B6.2",
    "name": "Cyber Security Training",
    "text": "The people who support the operation of your essential function are appropriately trained in cyber security. A range of approaches to cyber security training, awareness and communications are employed.",
    "status": {
    "Achieved": [
    "You have defined appropriate cyber security training and awareness activities for all roles in your organisation, from executives to the most junior roles.",
    "You use a range of teaching and communication techniques for cyber security training and awareness to reach the widest audience effectively.",
    "Cyber security information is easily available.",
    "All people in your organisation, from the most senior to the most junior, follow appropriate cyber security training paths.",
    "Each individual’s cyber security training is tracked and refreshed at suitable intervals.",
    "You routinely evaluate your cyber security training and awareness activities to ensure they reach the widest audience and are effective.",
    "You make cyber security information and good practice guidance easily accessible, widely available and you know it is referenced and used within your organisation."
    ],
    "Partially Achieved": [
    "You have defined appropriate cyber security training and awareness activities for all roles in your organisation, from executives to the most junior roles.",
    "You use a range of teaching and communication techniques for cyber security training and awareness to reach the widest audience effectively.",
    "Cyber security information is easily available."
    ],
    "Not Achieved": [
    "There are teams who operate and support your essential function that lack any cyber security training.",
    "Cyber security training is restricted to specific roles in your organisation.",
    "Cyber security training records for your organisation are lacking or incomplete."
    ]
    },
    "contextualized_to_park": "In Cyberland Park, all staff—from researchers managing critical lab data, maintenance teams handling generators and sensors, to the system administrator—receive regular, role-specific cyber security training. Training covers securing accounts, recognizing phishing and social engineering attempts, and maintaining operational security. Multiple training formats ensure accessibility, with progress tracked and training refreshed to keep security awareness high, mitigating risks like credential abuse and insider threats.",
    "related_mitre": [
    {
      "technique_id": "T1078",
      "name": "Valid Accounts",
      "explanation": "Training improves password and credential management to reduce risks from stolen or abused accounts."
    },
    {
      "technique_id": "T1566",
      "name": "Phishing",
      "explanation": "Training helps staff detect and avoid phishing attempts that target park systems."
    },
    {
      "technique_id": "T1036",
      "name": "Masquerading",
      "explanation": "Training raises awareness about techniques used to disguise malicious activities or software."
    }
    ]
    }
    ]
    }
},
"Objective C": {
    "Principle C1 - Security Monitoring": {
    "IGPs": [
    {
    "id": "C1.1",
    "name": "Monitoring Coverage",
    "text": "The data sources that you include in your monitoring allow for timely identification of security events which might affect the operation of your essential function.",
    "status": {
    "Achieved": [
    "Monitoring is based on an understanding of your networks, common cyber attack methods and what you need awareness of in order to detect potential security incidents that could affect the operation of your essential function (e.g. presence of malware, malicious emails, user policy violations).",
    "Your monitoring data provides enough detail to reliably detect security incidents that could affect the operation of your essential function.",
    "You easily detect the presence or absence of IoCs on your essential functions, such as known malicious command and control signatures.",
    "Extensive monitoring of user activity in relation to the operation of essential functions enables you to detect policy violations and an agreed list of suspicious or undesirable behaviour.",
    "You have extensive monitoring coverage that includes host-based monitoring and network gateways.",
    "All new systems are considered as potential monitoring data sources to maintain a comprehensive monitoring capability."
    ],
    "Partially Achieved": [
    "Data relating to the security and operation of some areas of your essential functions is collected but coverage is not comprehensive.",
    "You easily detect the presence or absence of IoCs on your essential function.",
    "Some user monitoring is done, but not covering a fully agreed list of suspicious or undesirable behaviour.",
    "You monitor traffic crossing your network boundary (including IP address connections as a minimum)."
    ],
    "Not Achieved": [
    "Data relating to the security and operation of your essential functions is not collected.",
    "You do not confidently detect the presence or absence of Indicators of Compromise (IoCs) on your essential functions, such as known malicious command and control signatures.",
    "You are not able to audit the activities of users in relation to your essential function.",
    "You do not capture any traffic crossing your network boundary including as a minimum IP connections."
    ]
    },
    "contextualized_to_park": "In Cyberland Park, this means comprehensive monitoring of network traffic between the research center, operational control systems like electrical generators and dinosaur sensors, and external connections. Host-based monitoring captures logs from Active Directory, research databases, and control devices. User activities, particularly those of the single system administrator and other privileged accounts, are closely audited for suspicious behavior. All IoT sensors and new devices are integrated into the monitoring system to detect malware, command and control traffic, and policy violations swiftly, ensuring quick response to security incidents.",
    "related_mitre": [
    {
      "technique_id": "T1078",
      "name": "Valid Accounts",
      "explanation": "Monitoring focuses on detecting abnormal use of valid credentials."
    },
    {
      "technique_id": "T1040",
      "name": "Network Sniffing",
      "explanation": "Monitoring network traffic to identify malicious or anomalous activity."
    },
    {
      "technique_id": "T1083",
      "name": "File and Directory Discovery",
      "explanation": "Detects unusual file system access or reconnaissance activity."
    },
    {
      "technique_id": "T1071",
      "name": "Application Layer Protocol",
      "explanation": "Detects command and control communications over common protocols."
    }
    ]
    },
    {
    "id": "C1.2",
    "name": "Securing Logs",
    "text": "You hold logging data securely and grant read access only to accounts with business need. No employee should ever need to modify or delete logging data within an agreed retention period, after which it should be deleted.",
    "status": {
    "Achieved": [
    "The integrity of logging data is protected, or any modification is detected and attributed.",
    "The logging architecture has mechanisms, processes and procedures to ensure that it can protect itself from threats comparable to those it is trying to identify. This includes protecting the function itself, and the data within it.",
    "Log data analysis and normalisation is only performed on copies of the data keeping the master copy unaltered.",
    "Logging datasets are synchronised, using an accurate common time source, so that separate datasets can be correlated in different ways.",
    "Access to logging data is limited to those with business need and no others.",
    "All actions involving all logging data (e.g. copying, deleting or modification, or even viewing) can be traced back to a unique user.",
    "Legitimate reasons for accessing logging data are given in use policies."
    ],
    "Partially Achieved": [
    "Only authorised staff can view logging data for investigations.",
    "Privileged users can view logging information.",
    "There is some monitoring of access to logging data (e.g., copying, deleting or modification, or even viewing)."
    ],
    "Not Achieved": [
    "It is possible for logging data to be easily edited or deleted by unauthorised users or malicious attackers.",
    "There is no controlled list of who can view and query logging information.",
    "There is no monitoring of the access to logging data.",
    "There is no policy for accessing logging data.",
    "Logging is not synchronised, using an accurate common time source."
    ]
    },
    "contextualized_to_park": "In Cyberland Park, this means all logs from critical systems including Active Directory, network infrastructure, IoT sensors monitoring dinosaur movements, electrical generators, and research systems are securely stored in tamper-evident repositories. Only authorised personnel can read logs, with no ability to modify or delete them until the retention period expires. Access to logs is fully audited and attributable, with strict policies governing legitimate use. Accurate time synchronization enables correlation of events across systems to detect and investigate incidents effectively.",
    "related_mitre": [
    {
      "technique_id": "T1078",
      "name": "Valid Accounts",
      "explanation": "Ensuring only authorized users can access logs prevents attackers abusing stolen credentials to erase traces."
    },
    {
      "technique_id": "T1114",
      "name": "Email Collection",
      "explanation": "Monitoring logs can help detect data exfiltration attempts via email."
    },
    {
      "technique_id": "T1070",
      "name": "Indicator Removal",
      "explanation": "Prevents attackers from deleting or tampering with logs to cover their tracks."
    }
    ]
    },
    {
    "id": "C1.3",
    "name": "Generating Alerts",
    "text": "Evidence of potential security incidents contained in your monitoring data is reliably identified and triggers alerts.",
    "status": {
    "Achieved": [
    "Alerts are tested to ensure that they are generated reliably and that it is possible to distinguish genuine security incidents from false alarms.",
    "Alerts can be easily resolved to network assets using knowledge of networks and systems. The resolution of these alerts is performed in almost real time.",
    "Security alerts relating to all essential functions are prioritised and this information is used to support incident management.",
    "Logs are reviewed almost continuously, in real time.",
    "A wide range of signatures and indicators of compromise is used for investigations of suspicious activity and alerts."
    ],
    "Partially Achieved": [
    "Alerts from third party security software are investigated, and action taken.",
    "Some, but not all, logging datasets can be easily queried with search tools to aid investigations.",
    "The resolution of alerts to a network asset or system is performed regularly.",
    "Security alerts relating to some essential functions are prioritised.",
    "Logs are reviewed at regular intervals."
    ],
    "Not Achieved": [
    "Alerts from third party security software are not investigated e.g. Anti-Virus (AV) providers.",
    "Logs are distributed across devices with no easy way to access them other than manual login or physical action.",
    "The resolution of alerts to a network asset or system is not performed.",
    "Security alerts relating to essential functions are not prioritised.",
    "Logs are reviewed infrequently."
    ]
    },
    "contextualized_to_park": "In Cyberland Park, alerts from monitoring systems including Active Directory, network infrastructure, IoT sensors tracking dinosaur movements, electrical generators, and research systems are regularly tested and reliably generated to minimize false alarms. Alerts are quickly resolved to specific network assets and prioritized based on their potential impact on essential functions such as containment and power. Logs and alerts are reviewed continuously or near real-time to enable rapid incident response, using a broad set of signatures and indicators of compromise tailored to the unique threats faced by the park.",
    "related_mitre": [
    {
      "technique_id": "T1078",
      "name": "Valid Accounts",
      "explanation": "Weak account policies at kiosks could allow attackers to abuse valid credentials."
    },
    {
      "technique_id": "T1059",
      "name": "Command and Scripting Interpreter",
      "explanation": "Detects unauthorized execution of scripts which might indicate attacker activity."
    },
    {
      "technique_id": "T1204",
      "name": "User Execution",
      "explanation": "Alerts suspicious user activities that might signal phishing or social engineering."
    }
    ]
    },
    {
    "id": "C1.4",
    "name": "Identifying Security Incidents",
    "text": "You contextualise alerts with knowledge of the threat and your systems, to identify those security incidents that require some form of response.",
    "status": {
    "Achieved": [
    "Logging data is enriched with other network knowledge and data when investigating certain suspicious activity or alerts.",
    "A wide range of signatures and indicators of compromise is used for investigations of suspicious activity and alerts.",
    "Alerts can be easily resolved to network assets using knowledge of networks and systems. The resolution of these alerts is performed in almost real time.",
    "Security alerts relating to all essential functions are prioritised and this information is used to support incident management.",
    "Logs are reviewed almost continuously, in real time."
    ],
    "Partially Achieved": [
    "Alerts from third party security software are investigated, and action taken.",
    "Some, but not all, logging datasets can be easily queried with search tools to aid investigations.",
    "The resolution of alerts to a network asset or system is performed regularly.",
    "Security alerts relating to some essential functions are prioritised.",
    "Logs are reviewed at regular intervals."
    ],
    "Not Achieved": [
    "Alerts from third party security software are not investigated.",
    "Logs are distributed across devices with no easy way to access them other than manual login or physical action.",
    "The resolution of alerts to a network asset or system is not performed.",
    "Security alerts relating to essential functions are not prioritised."
    ]
    },
    "contextualized_to_park": "In Cyberland Park, alerts from kiosks and online booking systems are enriched with network and threat intelligence to better understand suspicious activity. Investigations use tailored signatures and IoCs relevant to ticketing systems. Alerts are quickly linked to specific kiosks or servers, enabling near real-time response. All ticketing-related security alerts are prioritised and logs are reviewed continuously to maintain security of ticket data.",
    "related_mitre": [
   {
      "technique_id": "T1078",
      "name": "Valid Accounts",
      "explanation": "Weak account policies at kiosks could allow attackers to abuse valid credentials."
    },
    {
      "technique_id": "T1566",
      "name": "Phishing",
      "explanation": "Phishing attacks may target users of kiosks or online booking systems to gain credentials."
    },
    {
      "technique_id": "T1083",
      "name": "File and Directory Discovery",
      "explanation": "Attackers may attempt to discover files related to ticketing systems for further exploitation."
    }
    ]
    },
    {
    "id": "C1.5",
    "name": "Monitoring Tools and Skills",
    "text": "Monitoring staff skills, tools and roles, including any that are outsourced, should reflect governance and reporting requirements, expected threats and the complexities of the network or system data they need to use. Monitoring staff have knowledge of the essential functions they need to protect.",
    "status": {
    "Achieved": [
    "You have monitoring staff, who are responsible for the analysis, investigation and reporting of monitoring alerts covering both security and performance.",
    "Monitoring staff have defined roles and skills that cover all parts of the monitoring and investigation process.",
    "Monitoring staff follow process and procedures that address all governance reporting requirements, internal and external.",
    "Monitoring staff are empowered to look beyond the fixed process to investigate and understand non-standard threats, by developing their own investigative techniques and making new use of data.",
    "Your monitoring tools make use of all logging data collected to pinpoint activity within an incident.",
    "Monitoring staff and tools drive and shape new log data collection and can make wide use of it.",
    "Monitoring staff are aware of the operation of essential functions and related assets and can identify and prioritise alerts or investigations that relate to them."
    ],
    "Partially Achieved": [
    "Monitoring staff have some investigative skills and a basic understanding of the data they need to work with.",
    "Monitoring staff can report to other parts of the organisation (e.g. security directors, resilience managers).",
    "Your monitoring tools can make use of logging that would capture most unsophisticated and untargeted attack types.",
    "Monitoring staff are aware of some essential functions and can manage alerts relating to them."
    ],
    "Not Achieved": [
    "There are no staff who perform a monitoring function.",
    "Monitoring staff do not have the correct specialist skills.",
    "Monitoring staff are not capable of reporting against governance requirements.",
    "Monitoring staff lack the skills to successfully perform some significant parts of the defined workflow.",
    "Monitoring tools are only able to make use of a fraction of logging data being collected.",
    "Monitoring tools cannot be configured to make use of new logging streams, as they come online."
    ]
    },
    "contextualized_to_park": "In Cyberland Park, monitoring staff understand the critical role of ticket kiosks and online booking systems, using tailored monitoring tools to detect suspicious activity and escalate incidents affecting visitor services.",
    "related_mitre": [
    {
      "technique_id": "T1059",
      "name": "Command and Scripting Interpreter",
      "explanation": "Monitoring should detect suspicious scripting or command execution indicative of attacker activity."
    },
    {
      "technique_id": "T1040",
      "name": "Network Sniffing",
      "explanation": "Monitoring tools need to analyze network traffic to detect unauthorized data collection or exfiltration attempts."
    },
    {
      "technique_id": "T1078",
      "name": "Valid Accounts",
      "explanation": "Monitoring staff should be able to detect misuse of valid credentials, especially at kiosks and booking systems."
    }
    ]
    },
    {
    "id": "C1.6",
    "name": "Threat Intelligence",
    "text": "You maintain and use appropriate threat intelligence sources to ensure your monitoring and protective measures remain effective.",
    "status": {
    "Achieved": [
    "You have selected threat intelligence sources or services using risk-based and threat-informed decisions based on your business needs and sector (e.g. vendor reporting and patching, strong anti-virus providers, sector and community-based infoshare, special interest groups).",
    "You apply all new signatures and IoCs within a reasonable (risk-based) time of receiving them.",
    "You receive signature updates for all your protective technologies (e.g. AV, IDS).",
    "You track the effectiveness of your intelligence feeds and actively share feedback on the usefulness of IoCs and any other indicators with the threat community (e.g. sector partners, threat intelligence providers, government agencies)."
    ],
    "Partially Achieved": [
    "Your organisation uses some threat intelligence services, but you don't necessarily choose sources or providers specifically because of your business needs, or specific threats in your sector.",
    "You receive updates for all your signature based protective technologies (e.g. AV, IDS).",
    "You apply some updates, signatures and IoCs in a timely way.",
    "You know how effective your threat intelligence is (e.g. by tracking how threat intelligence helps you identify security problems)."
    ],
    "Not Achieved": [
    "Your organisation has no sources of threat intelligence.",
    "You do not apply updates in a timely way, after receiving them (e.g. AV signature updates, other threat signatures or IoCs).",
    "You do not receive signature updates for all protective technologies such as AV and IDS or other software in use.",
    "You do not evaluate the usefulness of your threat intelligence or share feedback with providers or other users."
    ]
    },
    "contextualized_to_park": "In Cyberland Park, this means using threat intelligence tailored to the specific risks of ticket kiosks and online booking systems, ensuring timely application of signatures and IoCs, and actively sharing insights with relevant partners and vendors to stay ahead of emerging threats.",
    "related_mitre": [
    {
      "technique_id": "T1110",
      "name": "Brute Force",
      "explanation": "Attackers may attempt brute force attacks on kiosk and booking system credentials; timely threat intelligence helps detect and mitigate this."
    },
    {
      "technique_id": "T1204",
      "name": "User Execution",
      "explanation": "Phishing or social engineering attacks targeting staff or users can be detected and mitigated using threat intelligence."
    },
    {
      "technique_id": "T1078",
      "name": "Valid Accounts",
      "explanation": "Weak account policies at kiosks could allow attackers to abuse valid credentials."
    }
    ]
    }
    ]
    },
    "Principle C2 - Proactive Security Event Discovery": {
    "IGPs": [
    {
    "id": "C2.1",
    "name": "System Abnormalities for Attack Detection",
    "text": "You define examples of abnormalities in system behaviour that provide practical ways of detecting malicious activity that is otherwise hard to identify.",
    "status": {
    "Achieved": [
    "Normal system behaviour is fully understood to such an extent that searching for system abnormalities is a potentially effective way of detecting malicious activity (e.g. You fully understand which systems should and should not communicate and when).",
    "System abnormality descriptions from past attacks and threat intelligence, on yours and other networks, are used to signify malicious activity.",
    "The system abnormalities you search for consider the nature of attacks likely to impact on the networks and information systems supporting the operation of essential functions.",
    "The system abnormality descriptions you use are updated to reflect changes in your networks and information systems and current threat intelligence."
    ],
    "Not Achieved": [
    "Normal system behaviour is insufficiently understood to be able to use system abnormalities to detect malicious activity.",
    "You have no established understanding of what abnormalities to look for that might signify malicious activities."
    ]
    },
    "contextualized_to_park": "In Cyberland Park, this means clearly defining normal system behaviour for ticket kiosks and online booking systems, leveraging threat intelligence and past incidents to detect anomalies such as unusual login times, unexpected network connections, or abnormal transaction patterns that could indicate attacks.",
    "related_mitre": [
    {
      "technique_id": "T1078",
      "name": "Valid Accounts",
      "explanation": "Weak account policies at kiosks could allow attackers to abuse valid credentials."
    },
    {
      "technique_id": "T1036",
      "name": "Masquerading",
      "explanation": "Attackers may disguise malicious files or processes as legitimate ones; detecting these abnormalities helps identify attacks."
    },
    {
      "technique_id": "T1086",
      "name": "PowerShell",
      "explanation": "Unusual use of PowerShell or scripting can indicate malicious activity."
    }
    ]
    },
    {
    "id": "C2.2",
    "name": "Proactive Attack Discovery",
    "text": "You use an informed understanding of more sophisticated attack methods and of normal system behaviour to monitor proactively for malicious activity.",
    "status": {
    "Achieved": [
    "You routinely search for system abnormalities indicative of malicious activity on the networks and information systems supporting the operation of your essential function, generating alerts based on the results of such searches.",
    "You have justified confidence in the effectiveness of your searches for system abnormalities indicative of malicious activity."
    ],
    "Not Achieved": [
    "You do not routinely search for system abnormalities indicative of malicious activity."
    ]
    },
    "contextualized_to_park": "In Cyberland Park, this means establishing proactive monitoring of kiosks and online booking systems, using knowledge of typical usage patterns and advanced attack techniques to detect and alert on suspicious activity before it causes harm.",
    "related_mitre": [
    {
      "technique_id": "T1078",
      "name": "Valid Accounts",
      "explanation": "Weak account policies at kiosks could allow attackers to abuse valid credentials."
    },
    {
      "technique_id": "T1059",
      "name": "Command and Scripting Interpreter",
      "explanation": "Attackers may use scripting to execute commands on systems; detecting abnormal script execution helps discover attacks."
    },
    {
      "technique_id": "T1110",
      "name": "Brute Force",
      "explanation": "Proactive monitoring can detect brute force attempts to gain unauthorized access."
    }
    ]
    }
    ]
    }
},
"Objective D": {
    "Principle D1 - Response and Recovery Planning": {
    "IGPs": [
    {
    "id": "D1.1",
    "name": "Response Plan",
    "text": "You have an up-to-date incident response plan that is grounded in a thorough risk assessment that takes account of your essential function and covers a range of incident scenarios.",
    "status": {
    "Achieved": [
    "Your incident response plan is based on a clear understanding of the security risks to the networks and information systems supporting your essential function.",
    "Your incident response plan is comprehensive (i.e. covers the complete lifecycle of an incident, roles and responsibilities, and reporting) and covers likely impacts of both known attack patterns and of possible attacks, previously unseen.",
    "Your incident response plan is documented and integrated with wider organisational business and supply chain response plans.",
    "Your incident response plan is communicated and understood by the business areas involved with the operation of your essential functions.",
    "Your incident response plan is documented and shared with all relevant stakeholders.",
    "Your incident response plan is understood by all staff who are involved with your organisation's response function."
    ],
    "Partially Achieved": [
    "Your incident response plan covers your essential functions.",
    "Your incident response plan comprehensively covers scenarios that are focused on likely impacts of known and well-understood attacks only.",
    "Your incident response plan is understood by all staff who are involved with your organisation's response function."
    ],
    "Not Achieved": [
    "Your incident response plan is not documented.",
    "Your incident response plan does not include your organisation's identified essential function.",
    "Your incident response plan is not well understood by relevant staff."
    ]
    },
    "contextualized_to_park": "In Cyberland Park, this means having a clear, documented incident response plan that accounts for the specific risks to ticketing systems at kiosks and online bookings, ensuring roles and actions are defined and understood across all relevant teams.",
    "related_mitre": [
     {
      "technique_id": "T1589.001",
      "name": "Gather Victim Network Information: Network Topology",
      "explanation": "Understanding network topology is critical for incident response and detection planning."
    },
    {
      "technique_id": "T1499",
      "name": "Endpoint Denial of Service",
      "explanation": "Planning for potential impacts from denial of service attacks is part of incident response."
    },
    {
      "technique_id": "T1082",
      "name": "System Information Discovery",
      "explanation": "Collecting system information aids in incident investigation and response."
    },
    {
      "technique_id": "T1071",
      "name": "Application Layer Protocol",
      "explanation": "Understanding common attacker communication channels supports incident detection and response."
    }
    ]
    },
    {
    "id": "D1.2",
    "name": "Response and Recovery Capability",
    "text": "You have the capability to enact your incident response plan, including effective limitation of impact on the operation of your essential function. During an incident, you have access to timely information on which to base your response decisions.",
    "status": {
    "Achieved": [
    "You have tested, exercised and maintained the capability to enact your response plan and to recover services as planned.",
    "During incidents you have timely information and structured decision-making processes to support response and recovery actions.",
    "You have access to technical and organisational arrangements (including trusted third parties) to help limit impact and support restoration.",
    "You maintain clear communications and responsibilities across internal teams and with suppliers and partners to support recovery of essential functions."
    ],
    "Partially Achieved": [
    "You have some tested capability to enact parts of your incident response plan but not the full plan.",
    "You have arrangements for accessing information during an incident but these are not always timely or complete."
    ],
    "Not Achieved": [
    "You lack tested capability to enact your incident response plan or to recover essential functions.",
    "During incidents you do not have timely information to base response decisions on, or lack arrangements to limit impact and restore services."
    ]
    },
    "contextualized_to_park": "In Cyberland Park,  this means regularly testing and exercising incident response plans focused on ticketing systems at kiosks and online bookings, ensuring staff have access to timely information and clear communication channels during incidents to limit impact and restore services efficiently.",
    "related_mitre": [
    {
      "technique_id": "T1489",
      "name": "Service Stop",
      "explanation": "Attackers may attempt to stop essential services; response capabilities need to address service restoration."
    },
    {
      "technique_id": "T1609",
      "name": "Container Administration Command",
      "explanation": "Use of administrative commands during recovery or containment actions."
    },
    {
      "technique_id": "T1547",
      "name": "Boot or Logon Autostart Execution",
      "explanation": "Recovery processes may include addressing persistence mechanisms."
    }
    ]
    },
    {
    "id": "D1.3",
    "name": "Exercises and Testing",
    "text": "You regularly exercise and test your incident response arrangements, and incorporate lessons into plans and protective security.",
    "status": {
    "Achieved": [
    "Exercise scenarios are based on incidents experienced by your and other organisations or are composed using experience or threat intelligence.",
    "Exercise scenarios are documented, regularly reviewed, and validated.",
    "Exercises are routinely run, with the findings documented and used to refine incident response plans and protective security, in line with the lessons learned.",
    "Exercises test all parts of your response cycle relating to your essential functions (e.g. restoration of normal function levels)."
    ],
    "Partially Achieved": [
    "Exercises test some parts of the response cycle.",
    "Exercise outputs are used selectively to update response plans or controls."
    ],
    "Not Achieved": [
    "Incident response exercises are not routinely carried out or are carried out in an ad-hoc way.",
    "Outputs from exercises are not fed into the organisation's lessons learned process."
    ]
    },
    "contextualized_to_park": "In Cyberland Park, this means regularly running incident response exercises focused on scenarios such as ticket system outages or data breaches at kiosks and online bookings, ensuring lessons learned are applied to improve security and recovery plans.",
    "related_mitre": [
    {
      "technique_id": "T1499",
      "name": "Endpoint Denial of Service",
      "explanation": "Testing response to scenarios involving denial of service impacting essential endpoints like ticket kiosks."
    },
    {
      "technique_id": "T1086",
      "name": "PowerShell",
      "explanation": "Exercise response involving detection and mitigation of attacks using scripting tools."
    },
    {
      "technique_id": "T1059",
      "name": "Command and Scripting Interpreter",
      "explanation": "Testing detection and response to command-line or scripting-based attacks during exercises."
    }
    ]
    }
    ]
    },
    "Principle D2 - Lessons Learned": {
    "IGPs": [
    {
    "id": "D2.1",
    "name": "Incident Root Cause Analysis",
    "text": "When an incident occurs, steps must be taken to understand its root causes and ensure appropriate remediating action is taken.",
    "status": {
    "Achieved": [
    "Root cause analysis is conducted routinely as a key part of your lessons learned activities following an incident.",
    "Your root cause analysis is comprehensive, covering organisational process issues, as well as vulnerabilities in your networks, systems or software.",
    "All relevant incident data is made available to the analysis team to perform root cause analysis."
    ],
    "Not Achieved": [
    "You are not usually able to resolve incidents to a root cause.",
    "You do not have a formal process for investigating causes."
    ]
    },
    "contextualized_to_park": "In Cyberland Park, this means thoroughly investigating incidents involving ticketing systems and kiosks to identify root causes such as misconfigurations, credential misuse, or software vulnerabilities, and applying fixes to prevent recurrence.",
    "related_mitre": [
     {
      "technique_id": "T1078",
      "name": "Valid Accounts",
      "explanation": "Weak account policies at kiosks could allow attackers to abuse valid credentials."
    },
    {
      "technique_id": "T1600",
      "name": "Data Manipulation",
      "explanation": "Attackers may manipulate ticketing or booking data, requiring root cause analysis to identify how this occurred."
    },
    {
      "technique_id": "T1082",
      "name": "System Information Discovery",
      "explanation": "Understanding system configurations and information can help in root cause analysis of incidents."
    }
    ]
    },
    {
    "id": "D2.2",
    "name": "Using Incidents to Drive Improvements",
    "text": "Your organisation uses lessons learned from incidents to improve your security measures.",
    "status": {
    "Achieved": [
    "You have a documented incident review process/policy which ensures that lessons learned from each incident are identified, captured, and acted upon.",
    "Lessons learned cover issues with reporting, roles, governance, skills and organisational processes as well as technical aspects of networks and information systems.",
    "You use lessons learned to improve security measures, including updating and retesting response plans when necessary.",
    "Security improvements identified as a result of lessons learned are prioritised, with the highest priority improvements completed quickly.",
    "Analysis is fed to senior management and incorporated into risk management and continuous improvement."
    ],
    "Not Achieved": [
    "Following incidents, lessons learned are not captured or are limited in scope.",
    "Improvements arising from lessons learned following an incident are not implemented or not given sufficient organisational priority.",
    "You do not have a documented incident review process/policy."
    ]
    },
    "contextualized_to_park": "In Cyberland Park, this means systematically reviewing all incidents involving ticketing and kiosk systems to extract actionable lessons, improving staff training, policies, and technical controls to prevent repeat issues.",
    "related_mitre": [
    {
      "technique_id": "T1078",
      "name": "Valid Accounts",
      "explanation": "Weak account policies at kiosks could allow attackers to abuse valid credentials."
    },
    {
      "technique_id": "T1600",
      "name": "Data Manipulation",
      "explanation": "Lessons learned may reveal how data was altered during attacks, guiding improvements."
    },
    {
      "technique_id": "T1566",
      "name": "Phishing",
      "explanation": "Incidents involving phishing attacks on staff managing ticketing systems highlight areas for training and policy updates."
    }
    ]
    }
    ]
    }
}
}

